UNF16.RetailCRMИнтеграция/src/DataProcessors/crm_RetailCRMОбработка/crm_RetailCRMОбработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>crm_RetailCRMОбработка</name>
  <attributes>
    <name>ЗагружатьЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТипыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоОрганизаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТипыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданиеОплат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаОплатВCRM</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданиеРеализаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GUIDОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорпоративныеКлиенты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКНастройкам</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТипыДоставок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>since_Id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>offers_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботаСРозницей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЧеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЧекиНаВозврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаЛояльностиРозница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдКлиентаПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОформленияРозница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПЛНачислитьСоСписанием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПЛНеСписыватьСоСкидками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Эталонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаБроней</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданиеВозвратов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючCRM</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМагазина</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСпособыОформленияЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьЗагрузкуЗаказовПоСпособуОформления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстаткиСУчетомРезервов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабКонстанты</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСтатусы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаказа</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Отгрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отмена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перемещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Резервирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаСтатуса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеЗагружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСтатусыТоваров</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отмена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСтатусыСостояния</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабМенеджеры</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСклады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабОрганизации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодМагазина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьОстатки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабТипыЦен</name>
    <attributes>
      <name>ТипЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>КодCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабТипыОплат</name>
    <attributes>
      <name>КодCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплатыРозница</name>
      <type>
        <types>EnumRef.ВидыБезналичныхОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличнаяОплатаРозница</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабТипыДоставок</name>
    <attributes>
      <name>КодCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Перевозчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладДоставки</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабКаталог</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСпособыОформления</name>
    <attributes>
      <name>КодCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>CatalogRef.ИсточникиПривлеченияПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

UNF16.RetailCRMИнтеграция/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

UNF16.RetailCRMИнтеграция/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1055d15b-8cb5-4ff0-a526-7fd20a08a96c">
  <name>ДополнительныеРеквизитыИСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="af88ea84-5742-4c9f-9a02-6d0f25186f72">
    <name>Заголовок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="79ad09ba-875a-46bd-9cd9-9d084bf4f6ea">
    <name>НаборСвойств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

UNF16.RetailCRMИнтеграция/src/DataProcessors/crm_RetailCRMОбработка/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция УНФ_ПолучитьСвойство(Наименование, НазначениеСвойства, Тип = "Свойство", ТипЗначения = "Строка") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.Заголовок 	= &Наименование
	|	И СвойстваОбъектов.НаборСвойств = &НазначениеСвойства";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	Запрос.УстановитьПараметр("Наименование", 		Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();                      
	
	ЭтоСведение = ?(Тип = "Сведение", Истина, Ложь);
	ТипЗначенияСвойства = Новый ОписаниеТипов("Строка", ,
										  Новый КвалификаторыСтроки(99, ДопустимаяДлина.Переменная));
	НазваниеТЧ	= ?(Тип = "Свойство", "ДополнительныеСведения", "ДополнительныеРеквизиты");					
	
	Если ТипЗначения = "Число" Тогда 
		ТипЗначенияСвойства = Новый ОписаниеТипов("Число",
							  Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный));
	КонецЕсли;
						  
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда                         
		Свойство = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		Свойство.Наименование 				= Наименование;
		Свойство.Заголовок 					= Наименование;                
		Свойство.ЭтоДополнительноеСведение 	= ЭтоСведение;
		Свойство.НаборСвойств 				= НазначениеСвойства;
		Свойство.ТипЗначения 				= ТипЗначенияСвойства;
		Свойство.Записать();
		Свойство = Свойство.Ссылка;
		
	КонецЕсли;
	
	Если НазначениеСвойства[НазваниеТЧ].Найти(Свойство) = Неопределено Тогда
		
		НаборОбъект = НазначениеСвойства.ПолучитьОбъект();
		НоваяСтрока = НаборОбъект[НазваниеТЧ].Добавить();
		НоваяСтрока.Свойство = Свойство;
		НаборОбъект.Записать();
		
	КонецЕсли;

	Возврат Свойство;

КонецФункции

Процедура УНФ_УстановитьСвойствоУОбъекта(Объект, Свойство, Значение) Экспорт
	
	Попытка 
		ЗаписьРегистра = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Объект 	= Объект;
		ЗаписьРегистра.Свойство = Свойство;
		ЗаписьРегистра.Значение = Значение;
		ЗаписьРегистра.Записать(Истина);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("RetailCRM"
								, УровеньЖурналаРегистрации.Ошибка
								,
								,
								, ОписаниеОшибки);
	КонецПопытки;

КонецПроцедуры

Функция УНФ_ПолучитьЗначениеСвойстваОбъекта(Объект, Свойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Объект = &Объект";

	Запрос.УстановитьПараметр("Свойство", 	Свойство);
	Запрос.УстановитьПараметр("Объект", 	Объект);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;

КонецФункции

Функция УНФ_ВернутьКонтрагентаПоID(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение,
	|	ДополнительныеСведения.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Значение = &Значение
	|	И ДополнительныеСведения.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Значение", Идентификатор);
	СвойствоКонтрагентов = УНФ_ПолучитьСвойство("ИД", 
											Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты);
	Запрос.УстановитьПараметр("Свойство", СвойствоКонтрагентов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда 
			ИскКонт = Выборка.Объект;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИскКонт;
	
КонецФункции

Функция ПолучитьСвободныйОстаток(Номенклатура, Склад) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ЗапасыОстатки.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрНакопления.Запасы.Остатки КАК ЗапасыОстатки
	               |ГДЕ
	               |	ЗапасыОстатки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |	И ЗапасыОстатки.Номенклатура В(&Номенклатура)"; 
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
	
Функция ПолучитьПаки(НомерЗаказа) Экспорт
	
	ИмяСервера = crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("ИмяСервера");
	ApiKey = crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("КлючCRM");
	Ответ = crm_RetailCRMОбщийВызовСервера.HTTPзапросGET(ИмяСервера, 
								 "/api/v5/orders/packs?limit=100&filter[orderId]=" + НомерЗаказа + "&apiKey=" + ApiKey);	
	
	Ответ = crm_RetailCRMОбщийВызовСервера.UnJSON(Ответ);
	
	Успех = Ответ["success"];  
	
	ТаблицаБроней  = Новый ТаблицаЗначений;
	ТаблицаБроней.Колонки.Добавить("Номенклатура");
	ТаблицаБроней.Колонки.Добавить("ИдСклада");
	ТаблицаБроней.Колонки.Добавить("Количество");
	ТаблицаБроней.Колонки.Добавить("ИдПака");
	ТаблицаБроней.Колонки.Добавить("ЗакупочнаяЦена");
	
	Если Успех Тогда
		Для каждого пак Из Ответ["packs"] Цикл
				ИдентифТовара = crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("ИдентификаторТовара");
				Если ИдентифТовара = "Код" Тогда
					искНом	= Справочники.Номенклатура.найтиПоКоду(пак["item"]["offer"]["xmlId"]);
				ИначеЕсли ИдентифТовара = "Артикул" Тогда
					искНом	= Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", пак["item"]["offer"]["xmlId"]);
				ИначеЕсли ИдентифТовара = "GUID" Тогда
					уид 	= Новый УникальныйИдентификатор(пак["item"]["offer"]["xmlId"]);
					искНом	= Справочники.Номенклатура.ПолучитьСсылку(уид);	
				КонецЕсли;
				
				Строка = ТаблицаБроней.Добавить();
				Строка.Номенклатура = искНом;
				Строка.ИдПака = Число(пак["id"]); 
				Строка.ИдСклада = Строка(пак["store"]);
				Строка.Количество = Число(пак["quantity"]);
				Строка.ЗакупочнаяЦена = Число(пак["purchasePrice"]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаБроней;
КонецФункции

#КонецОбласти
